driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/CopyInSubBP/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:SampleXSD">
  <soapenv:Body>
    <urn:person name="Original Name">
      <urn:home country="US">
        <!--Optional:-->
        <urn:name>?string?</urn:name>
        <!--Optional:-->
        <urn:street>?string?</urn:street>
        <!--Optional:-->
        <urn:city>?string?</urn:city>
        <!--Optional:-->
        <urn:state>?string?</urn:state>
        <urn:zip>?1000.00?</urn:zip>
      </urn:home>
      <!--Optional:-->
      <urn:work country="US">
        <!--Optional:-->
        <urn:name>?string?</urn:name>
        <!--Optional:-->
        <urn:street>?string?</urn:street>
        <!--Optional:-->
        <urn:city>?string?</urn:city>
        <!--Optional:-->
        <urn:state>?string?</urn:state>
        <urn:zip>?1000.00?</urn:zip>
      </urn:work>
    </urn:person>
  </soapenv:Body>
</soapenv:Envelope>