driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/MsgTypeToXSDType6/Actual_20130311131750_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <person xmlns="urn:SampleXSD" xmlns:msgns="http://stc.com/xsddatatype6">
      <home>
        <zip>56789</zip>
      </home>
      <work>
        <zip>12345</zip>
      </work>
    </person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>